# Pandas üêº

Studying one of most important libraries of Data Analysis and Data Visualization in Python: The Pandas.

by: Pedro Florencio

---

<b> How to import? <b/>

In [227]:
import pandas as pd

<b> How to create a Series? <b/>

In [228]:
myIndex = ['a','b','c'] # We can use list, array or dict
myList = [10,20,30]

In [229]:
mySerie = pd.Series(data=myList, index=myIndex)
mySerie

a    10
b    20
c    30
dtype: int64

In [230]:
mySerie['a'] # Access to data

10

In [231]:
countries = pd.Series(index=['Brasil', 'Argentina', 'URSS'], data=[0,1,2])
countries

Brasil       0
Argentina    1
URSS         2
dtype: int64

In [232]:
countries2 = pd.Series(index=['Brasil', 'Argentina', 'Italia'], data=[2,4,6])
countries2

Brasil       2
Argentina    4
Italia       6
dtype: int64

<b> How to do Series operations? <b/>

In [233]:
soma = countries+countries2
soma

Argentina    5.0
Brasil       2.0
Italia       NaN
URSS         NaN
dtype: float64

<b> How to create a DataFrame? <b/>

In [234]:
import numpy as np

mylist2 = ['Pedro','Maria','Jo√£o','Karol', 'Junior','Manoel','Aline','Geralda','Alana']
a = np.array(lista)
names = a.reshape(3,3)

df = pd.DataFrame(data= names,index=['A','B','C'], columns=[1,2,3])
df

       1        2       3
A  Pedro    Maria    Jo√£o
B  Karol   Junior  Manoel
C  Aline  Geralda   Alana

<b> How to access data from a DataFrame? <b/>

In [235]:
df[2] # For columns

A      Maria
B     Junior
C    Geralda
Name: 2, dtype: object

In [236]:
df.loc['A'] # For lines (index)

1    Pedro
2    Maria
3     Jo√£o
Name: A, dtype: object

In [237]:
df.iloc[0] # For lines, but with number of index

1    Pedro
2    Maria
3     Jo√£o
Name: A, dtype: object

In [238]:
df.loc[['A','B'],[1,3]] # Slicing of a DataFrame

       1       3
A  Pedro    Jo√£o
B  Karol  Manoel

<b> How to reset index? <b/>

In [239]:
df.reset_index(inplace=True)
df

  index      1        2       3
0     A  Pedro    Maria    Jo√£o
1     B  Karol   Junior  Manoel
2     C  Aline  Geralda   Alana

<b> How to add a column? <b/>

In [240]:
col = ['Wow','I am','New']
df[4] = col
df

  index      1        2       3     4
0     A  Pedro    Maria    Jo√£o   Wow
1     B  Karol   Junior  Manoel  I am
2     C  Aline  Geralda   Alana   New

In [241]:
df.set_index(4,inplace=True) # The column is a new index

In [242]:
df

     index      1        2       3
4
Wow      A  Pedro    Maria    Jo√£o
I am     B  Karol   Junior  Manoel
New      C  Aline  Geralda   Alana

<b> Missing data <b/>

In [243]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [244]:
df = pd.DataFrame(d)

In [245]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [246]:
df.dropna(thresh=2) # It removes all lines containing 2 NaN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [247]:
df.fillna(value=0) #  It replaces all NaN with the value

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [248]:
df.fillna(method='ffill') # It replaces NaN with the last valid observation

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

<b> Group By <b/>

In [249]:
data = {'Company':['GOOGLE','GOOGLE','MSTF','MSTF','FB','FB'],
         'Name':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [250]:
df = pd.DataFrame(data)
df

  Company     Name  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120
2    MSTF      Amy    340
3    MSTF  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [251]:
group = df.groupby('Company')

In [252]:
group.sum()

         Sales
Company
FB         593
GOOGLE     320
MSTF       464

<b> Concatenating/Joining/Merging <b/>

In [290]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [254]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [255]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [256]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [257]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [258]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [259]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [260]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [261]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [262]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [263]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [264]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

<b> Operations <b/>

In [265]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [266]:
df['col2'].unique() # Selecting unique values

array([444, 555, 666], dtype=int64)

In [267]:
df['col2'].nunique()

3

In [268]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [269]:
def vezes2 (x):
    return x*2

In [270]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [271]:
df['col1'].apply(lambda x : x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [272]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [273]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [274]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

<b> Input/Output <b/>

In [283]:
df = pd.read_csv('genres.csv')
df.head()

C:\Users\pedro\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3071: DtypeWarning: Columns (19) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

,danceability,energy,key,loudness,mode,speechiness,acousticness,instrumentalness,liveness,valence,...,id,uri,track_href,analysis_url,duration_ms,time_signature,genre,song_name,Unnamed: 0,title
0,0.831,0.814,2,-7.364,1,0.4200,0.0598,0.013400,0.0556,0.3890,...,2Vc6NJ9PW9gD9q343XFRKx,spotify:track:2Vc6NJ9PW9gD9q343XFRKx,https://api.spotify.com/v1/tracks/2Vc6NJ9PW9gD...,https://api.spotify.com/v1/audio-analysis/2Vc6...,124539,4,Dark Trap,Mercury: Retrograde,NaN,NaN
1,0.719,0.493,8,-7.230,1,0.0794,0.4010,0.000000,0.1180,0.1240,...,7pgJBLVz5VmnL7uGHmRj6p,spotify:track:7pgJBLVz5VmnL7uGHmRj6p,https://api.spotify.com/v1/tracks/7pgJBLVz5Vmn...,https://api.spotify.com/v1/audio-analysis/7pgJ...,224427,4,Dark Trap,Pathology,NaN,NaN
2,0.850,0.893,5,-4.783,1,0.0623,0.0138,0.000004,0.3720,0.0391,...,0vSWgAlfpye0WCGeNmuNhy,spotify:track:0vSWgAlfpye0WCGeNmuNhy,https://api.spotify.com/v1/tracks/0vSWgAlfpye0...,https://api.spotify.com/v1/audio-analysis/0vSW...,98821,4,Dark Trap,Symbiote,NaN,NaN
3,0.476,0.781,0,-4.710,1,0.1030,0.0237,0.000000,0.1140,0.1750,...,0VSXnJqQkwuH2ei1nOQ1nu,spotify:track:0VSXnJqQkwuH2ei1nOQ1nu,https://api.spotify.com/v1/tracks/0VSXnJqQkwuH...,https://api.spotify.com/v1/audio-analysis/0VSX...,123661,3,Dark Trap,ProductOfDrugs (Prod. The Virus and Antidote),NaN,NaN
4,0.798,0.624,2,-7.668,1,0.2930,0.2170,0.000000,0.1660,0.5910,...,4jCeguq9rMTlbMmPHuO7S3,spotify:track:4jCeguq9rMTlbMmPHuO7S3,https://api.spotify.com/v1/tracks/4jCeguq9rMTl...,https://api.spotify.com/v1/audio-analysis/4jCe...,123298,4,Dark Trap,Venom,NaN,NaN

In [284]:
len(df)

42305